import React from "react";
function About () {
  return (
    <div class="container" style={{color:"white", width:"1000px"}}>
      <h1>Οδηγίες χρήσης της σελίδας</h1>
      <br/>
      <h2>Analytic Hierarchy Process - AHP</h2>
      <blockquote>
        <p>
          Η σελίδα "AHP" αναλαμβάνει την αναζήτηση της βέλτιστης περιοχής στην Αθήνα και τον Πειραιά χρησιμοποιώντας 
          την τεχνική Αναλυτικής Ιεράρχησης (AHP). Στο αριστερό μέρος της σελίδας εμφανίζονται διαδοχικά οι πίνακες με τις 
          παραμέτρους, τους οποίους ο χρήστης πρέπει να συμπληρώσει προκειμένου να παραχθούν τα αντίστοιχα βάρη. Στην άκρη κάθε 
          πίνακα, υπολογίζεται και ο λόγος συνέπειας (CR), ο οποίος πρέπει να είναι κοντά στο μηδέν για να εξασφαλιστεί η σωστή 
          παραγωγή δεδομένων. Αφού ολοκληρωθεί η συμπλήρωσή τους, ο χρήστης πατάει το κουμπί "Run Algorithm", ενεργοποιώντας έτσι 
          τη διαδικασία παραγωγής των δεδομένων. Μόλις ολοκληρωθεί η διαδικασία, εμφανίζεται στο κέντρο της σελίδας ένας πίνακας με 
          τα ονόματα κάθε περιοχής και δίπλα του ο χάρτης της Αθήνας και του Πειραιά με πολύγωνα που αντιστοιχούν στις περιοχές του 
          πίνακα. Τα πολύγωνα είναι χρωματισμένα ανάλογα με την καταλληλότητά τους βάσει των παραμέτρων που εισήγαγε ο χρήστης, όπου 
          το πράσινο χρώμα υποδεικνύει τις πιο κατάλληλες περιοχές, ενώ η καταλληλότητα μειώνεται καθώς το χρώμα πλησιάζει προς το 
          κόκκινο.
        </p>
      </blockquote>
      <br/>
      <h2>Spacial Search</h2>
      <blockquote>
        <p>
        Η σελίδα "Spatial Search" αναλαμβάνει την αναζήτηση της βέλτιστης πόλης στην Ελλάδα με βάση τα φίλτρα που θα επιλέξει 
        ο χρήστης. Στο αριστερό μέρος της σελίδας, υπάρχει η λίστα με τα φίλτρα που μπορεί να επιλέξει 
        ο χρήστης για την αναζήτηση. Η επιλογή της περιφέρειας είναι απαραίτητη, ενώ τα υπόλοιπα φίλτρα είναι προαιρετικά. 
        Όταν ο χρήστης συμπληρώσει τα φίλτρα, πατάει το κουμπί "Search" για να ξεκινήσει η αναζήτηση. 
        Η διάρκεια της αναζήτησης μπορεί να διαρκέσει από λίγα δευτερόλεπτα έως μερικά λεπτά, ανάλογα με τα φίλτρα που επιλέγονται. 
        Αφού ολοκληρωθεί η αναζήτηση, εμφανίζεται στο κέντρο της σελίδας ένας πίνακας με τα ονόματα των πόλεων που πληρούν τα κριτήρια 
        του χρήστη, ενώ στα δεξιά εμφανίζεται ο χάρτης της περιφέρειας που επέλεξε ο χρήστης με τα σημεία που αντιστοιχούν στις πόλεις 
        του πίνακα. Πατώντας σε μια πόλη στον χάρτη, εμφανίζονται όλες οι πληροφορίες της περιοχής βάσει των φίλτρων.
        </p>
      </blockquote>
    </div>
  );
}

export default About;