import React from "react";
function Home() {
  return (
    <div class="container" style={{color:"white", width:"1000px"}}>
      <h1>Eπιλογή του ιδανικού τόπου κατοικίας</h1>
      <br/>
      <blockquote>
        <p>
          Η επιλογή του ιδανικού τόπου κατοικίας είναι μια σημαντική απόφαση που αφορά πολλά άτομα.
          Αυτή η διπλωματική εργασία παρουσιάζει την ανάπτυξη μιας διαδικτυακής εφαρμογής που βασίζεται σε 
          γεωγραφικά δεδομένα και τεχνικές Αναλυτικής Ιεραρχίας (AHP) για την καλύτερη λήψη απόφασης σχετικά με την επιλογή της κατοικίας. 
          Οι χρήστες μπορούν να ορίσουν τα δικά τους κριτήρια και προτιμήσεις και η εφαρμογή προσφέρει προσαρμοσμένες 
          συστάσεις για περιοχές που πληρούν αυτά τα κριτήρια. Η διπλωματική εργασία αναλύει τη μεθοδολογία και την υλοποίηση της εφαρμογής, 
          εξετάζοντας την αποτελεσματικότητά της σε διάφορες περιοχές. Η βάση δεδομένων περιέχει χωρικά δεδομένα, σε μορφή διανυσμάτων.
          Εκτός από τις συντεταγμένες για κάθε περιοχή, περιλαμβάνει και άλλες σημαντικές πληροφορίες, 
          όπως δεδομένα για τα χαρακτηριστικά των περιοχών που αφορούν την ασφάλεια, τη γεωγραφία, τη δημογραφία και άλλα. 
          Για την κατασκευή ενός μοντέλου πολυκριτηριακής ανάλυσης πραγματοποιείται χρήση της μεθοδολογίας σταθμισμένης πολυκριτηριακής 
          χαρτογραφικής υπέρθεσης επιπέδων συνδυάζοντας όλα τα διαθέσιμα δεδομένα  για την κατασκευή ενός απλοποιημένου μοντέλου αποτίμησης 
          καταλληλότερης περιοχής για κατοικία, σύμφωνα με τις προτιμήσεις του χρήστη.
          </p>
      </blockquote>
    </div>
  );
}

export default Home;